app/controllers/baptisms_controller.rb

  def create
    @user = current_user
    @baptism = @user.build_baptism(baptism_params)
    if @baptism.save
---
INSERT INTO "baptisms" ("local", "date", "parish", "minister", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["local", "Legnica"], ["date", "1991-02-06"], ["parish", "Katedra"], ["minister", "Bishopek"], ["created_at", "2015-10-28 10:18:50.445899"], ["updated_at", "2015-10-28 10:18:50.445899"]]

  def update
    @user = current_user
    @baptism = @user.baptism
    if @baptism.update(baptism_params)
---
UPDATE "baptisms" SET "parish" = ?, "updated_at" = ? WHERE "baptisms"."id" = ?  [["parish", "Wielowieś"], ["updated_at", "2015-12-07 22:10:10.525394"], ["id", 29]]

  def destroy
    @baptism = current_user.baptism
    @baptism.destroy
---
DELETE FROM "baptisms" WHERE "baptisms"."id" = ?  [["id", 29]]