app/controllers/baptisms_controller.rb

SELECT  "baptisms".* FROM "baptisms" WHERE "baptisms"."user_id" = ? LIMIT 1  [["user_id", 6]]
---
  def show
    @user = current_user
    @baptism = @user.baptism.find(params[:id])